build/ForkJoinPool-1-worker-13.log

16:02:48.396 From karate-config file 
16:02:48.521 after scenario inside config 
16:02:48.521 From karate-config file 
16:02:48.896 request:
1 > POST https://www.w3schools.com/xml/tempconvert.asmx
1 > Accept-Encoding: gzip,deflate
1 > Connection: Keep-Alive
1 > Content-Length: 347
1 > Content-Type: text/xml; charset=UTF-8
1 > Host: www.w3schools.com
1 > SOAPAction: https://www.w3schools.com/xml/CelsiusToFahrenheit
1 > User-Agent: Apache-HttpClient/4.5.12 (Java/1.8.0_251)
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
      <soap:Body>
    <CelsiusToFahrenheit xmlns="https://www.w3schools.com/xml/">
    <Celsius>37</Celsius>
      </CelsiusToFahrenheit>
    </soap:Body>
</soap:Envelope>

16:02:49.334 response time in milliseconds: 432.67
1 < 200
1 < Cache-Control: private, max-age=0,public
1 < Content-Type: text/xml; charset=utf-8
1 < Date: Fri, 05 Feb 2021 10:24:38 GMT
1 < Server: Microsoft-IIS/7.5
1 < Vary: Accept-Encoding
1 < X-AspNet-Version: 4.0.30319
1 < X-Frame-Options: SAMEORIGIN
1 < X-Powered-By: ASP.NET
<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><CelsiusToFahrenheitResponse xmlns="https://www.w3schools.com/xml/"><CelsiusToFahrenheitResult>98.6</CelsiusToFahrenheitResult></CelsiusToFahrenheitResponse></soap:Body></soap:Envelope>

16:02:49.334 [print] {
  "Cache-Control": [
    "private, max-age=0,public"
  ],
  "Content-Type": [
    "text/xml; charset=utf-8"
  ],
  "Date": [
    "Fri, 05 Feb 2021 10:24:38 GMT"
  ],
  "Server": [
    "Microsoft-IIS/7.5"
  ],
  "Vary": [
    "Accept-Encoding"
  ],
  "X-AspNet-Version": [
    "4.0.30319"
  ],
  "X-Frame-Options": [
    "SAMEORIGIN"
  ],
  "X-Powered-By": [
    "ASP.NET"
  ]
}

16:02:49.365 [print] [
  "Microsoft-IIS/7.5"
]

16:02:49.365 [print] Microsoft-IIS/7.5
16:02:49.381 [print] <soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soap:Body>
    <CelsiusToFahrenheitResponse xmlns="https://www.w3schools.com/xml/">
      <CelsiusToFahrenheitResult>98.6</CelsiusToFahrenheitResult>
    </CelsiusToFahrenheitResponse>
  </soap:Body>
</soap:Envelope>

16:02:49.381 [print] 433
16:02:49.381 [print] 200
16:02:49.381 after scenario inside config 
16:02:49.615 From karate-config file 
16:02:49.631 [print] 123
16:02:49.631 33 
16:02:49.631 after scenario inside config 
16:02:49.755 From karate-config file 
16:02:49.755 request:
1 > POST https://www.w3schools.com/xml/tempconvert.asmx/CelsiusToFahrenheit
1 > Accept-Encoding: gzip,deflate
1 > Connection: Keep-Alive
1 > Content-Length: 10
1 > Content-Type: application/x-www-form-urlencoded; charset=UTF-8
1 > Host: www.w3schools.com
1 > User-Agent: Apache-HttpClient/4.5.12 (Java/1.8.0_251)
Celsius=40

16:02:50.068 response time in milliseconds: 311.37
1 < 200
1 < Cache-Control: private, max-age=0,public
1 < Content-Type: text/xml; charset=utf-8
1 < Date: Fri, 05 Feb 2021 10:24:39 GMT
1 < Server: Microsoft-IIS/7.5
1 < Vary: Accept-Encoding
1 < X-AspNet-Version: 4.0.30319
1 < X-Frame-Options: SAMEORIGIN
1 < X-Powered-By: ASP.NET
<?xml version="1.0" encoding="utf-8"?>
<string xmlns="https://www.w3schools.com/xml/">104</string>

16:02:50.068 [print] <string xmlns="https://www.w3schools.com/xml/">104</string>

16:02:50.068 [print] {
  "Cache-Control": [
    "private, max-age=0,public"
  ],
  "Content-Type": [
    "text/xml; charset=utf-8"
  ],
  "Date": [
    "Fri, 05 Feb 2021 10:24:39 GMT"
  ],
  "Server": [
    "Microsoft-IIS/7.5"
  ],
  "Vary": [
    "Accept-Encoding"
  ],
  "X-AspNet-Version": [
    "4.0.30319"
  ],
  "X-Frame-Options": [
    "SAMEORIGIN"
  ],
  "X-Powered-By": [
    "ASP.NET"
  ]
}

16:02:50.068 [print] 311
16:02:50.068 [print] xml
16:02:50.068 after scenario inside config 
